Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ལས་ས་བཅུ་པའི་ལེའུ་སྟེ།
en: The Mahāvaipulya Sūtra “A Multitude of Buddhas” Chapter 31: The Ten Bhūmis

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལྷའི་རྒྱལ་པོ་དབང་སྒྱུར་གྱི་གནས་ཀྱི་ནོར་བུ་རིན་པོ་ཆེ་དམ་པའི་ཁང་པ་ན།
en: Then the Bhagavat was in the deva king Vaśavartin’s divine palace of precious jewels, together with a great saṅgha of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཆེན་པོ་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ།
en: They were all irreversible and one lifetime away from attaining the highest complete enlightenment. They had gathered there from various worlds.

source: འཇིག་རྟེན་གྱི་ཁམས་གཞན་དང་གཞན་ནས་འདུས་པ་ཤ་སྟག་ཀུན་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་ཡུལ་དང་སྤྱོད་ཡུལ་ཐམས་ཅད་རབ་ཏུ་ཐོབ་པས་གནས་པ།
en: They dwelled in the attainment of the scope and range of the wisdom of all bodhisattvas.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་ཀྱི་ཡུལ་ལ་འཇུག་ཅིང་གཞོལ་བའི་སྤྱོད་ཡུལ་མ་བཏང་བ།
en: They maintained the range of activity that approaches and enters the scope of the wisdom of all tathāgatas.

source: འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བར་བྱ་བའི་དུས་བཞིན་དུ་ཐོགས་པ་མེད་པའི་བྱིན་གྱི་རླབས་རྣམ་པ་ཐ་དད་པས་བྱ་བ་ཐམས་ཅད་ཡང་དག་པར་སྟོན་པ་ལ་མཁས་པ།
en: They were skilled in manifesting at the proper moment in time all the activities of unimpeded blessings that would ripen and guide all beings.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ཐམས་ཅད་མངོན་པར་བསྒྲུབ་ཅིང་བསྐལ་པ་དང་ཞིང་དང་དུས་སུ་སྤྱོད་པ་ལ་གནས་པའི་རྒྱུན་མི་གཅོད་པ།
en: They had a range of activity that continually fulfilled the prayers of all bodhisattvas, and they continued in their conduct throughout eons, realms, and times.

source: །བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་དང་ཡེ་ཤེས་དང་རྫུ་འཕྲུལ་གྱི་ཚོགས་ཡོངས་སུ་རྫོགས་ཤིང་འགྲོ་བ་ཐམས་ཅད་ཉེ་བར་འཚོ་བ་མི་ཟད་པ་ལ་རབ་ཏུ་ཞུགས་པ།
en: They had completed the accumulations of the merit, wisdom, and miraculous powers of all bodhisattvas, and they had unceasingly cared for all beings.

source: བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་དང་། ཐབས་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དམ་པ་ཐོབ་པ།
en: They had attained the highest perfection of the wisdom and methods of all bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པས་འཁོར་བ་དང་། མྱ་ངན་ལས་འདས་པའི་སྒོ་ཡང་དག་པར་བསྟན་ཅིང་ཤིན་ཏུ་བསྒྲུབ་པའི་རྒྱུན་མི་གཅོད་པ།
en: They had unceasing accomplishment of bodhisattva conduct, manifesting the doorways of saṃsāra and nirvāṇa.

source: བྱང་ཆུབ་སེམས་དཔའི་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་དང་། མངོན་པར་ཤེས་པ་དང་། རིག་པ་དང་ཡེ་ཤེས་ལ་རྣམ་པར་རོལ་པའི་མངོན་པར་ཤེས་པས་བྱ་བ་ཐམས་ཅད་ཡང་དག་པར་སྟོན་པ་ལ་མཁས་པ།
en: They were skilled in manifesting all the activities that come from being adept in the dhyānas, liberations , samādhis, samāpattis, clairvoyances, and wisdom of all bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་དང་སྟོབས་དང་། དབང་ཐམས་ཅད་ཐོབ་ཅིང་མངོན་པར་འདུ་བྱ་བ་མེད་པའི་སེམས་སྐད་ཅིག་གིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་འདོད་པ་ལ་སྔུན་དུ་འདྲེན་པའི་གཏམ་གྱི་སྐྱེས་བུ་དམ་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་ཡང་དག་པར་གཟུང་བ་དང་། སངས་རྒྱས་ལ་མཆོད་པ་དང་། རིམ་གྲོ་རྒྱ་ཆེན་པོ་བྱ་བའི་དོན་དུ་མངོན་པར་བརྩོན་པ།
en: They had attained mastery of the miraculous powers of all bodhisattvas. Without performing any action, they went in a mind’s instant to the assemblies of the followers of all tathāgatas as individuals who would be their foremost interlocutors. They maintained the Dharma wheels of all tathāgatas. They engaged in a multitude of offerings and acts of service to the buddhas.

source: བྱང་ཆུབ་སེམས་དཔའི་ལས་ཐམས་ཅད་ཡང་དག་པར་བླང་བ་མཉམ་པ་ཉིད་ཀྱི་སྦྱོར་བས་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་ལུས་ཀྱི་གཟུགས་བརྙན་རབ་ཏུ་འབྱུང་བ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་ཆགས་པ་མེད་པའི་དབྱངས་རབ་ཏུ་སྒྲོག་པས་དུས་གསུམ་ཐམས་ཅད་དུ་ཆགས་པ་མེད་པའི་སེམས་དང་། ཡེ་ཤེས་ཀྱི་ཡུལ་རྒྱས་པར་འགེངས་པ།
en: They manifested the appearance of bodies in all worlds and with equanimity engaged in undertaking the activities of all bodhisattvas. The unimpeded sound of their voices resounded throughout the entire realm of phenomena so that the three times were pervaded by the scope of the unimpeded wisdom of their minds.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་དང་ནན་ཏན་ཡོངས་སུ་རྫོགས་པ་ཐམས་ཅད་བསྐལ་པ་བརྗོད་དུ་མེད་པར་རྒྱུན་མི་ཆད་པར་ཡང་དག་པར་བསྟན་པ་ལ་ཡོན་ཏན་བསྔགས་ཤིང་བརྗོད་པ་ཟད་མི་ཤེས་པ་ཤ་སྟག་སྟེ།
en: They had the perfection of the acquisition of the qualities of all bodhisattvas and taught them continuously for uncountable eons by unceasingly expressing praises of these qualities.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རིན་པོ་ཆེའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པད་མོའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དཔལ་གྱི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པད་མོ་དཔལ་གྱི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉི་མའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཙང་བའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཟླ་བ་དྲི་མ་མྱེད་པའི་སྙིང་པོ་དང་། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྒྱན་རྣམ་པར་བཀོད་པ་ཐམས་ཅད་རབ་ཏུ་སྣང་བར་སྟོན་པའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡེ་ཤེས་རྣམ་པར་སྣང་བའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དཔལ་ཡིད་དུ་འོང་བའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཙན་དན་དཔལ་གྱི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མེ་ཏོག་དཔལ་གྱི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མེ་ཏོག་རྒྱས་པ་དཔལ་གྱི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དཔལ་ལྷའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསོད་ནམས་དཔལ་གྱི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསྒྲིབས་པ་མྱེད་པའི་ཡེ་ཤེས་རྣམ་པར་དག་པའི་དཔལ་གྱི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་དཔལ་གྱི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཐུ་ཆེན་དཔལ་གྱི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དྲི་མ་མེད་པའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དྲི་མ་དང་བྲལ་བའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོབས་པ་སྣ་ཚོགས་རྒྱན་གྱི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འོད་ཟེར་གྱི་དྲ་བ་ཆེན་པོ་རབ་ཏུ་སྣང་བའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འོད་དྲི་མ་མེད་པའི་དཔལ་གྱི་གཟི་བརྗིད་བཟང་པོའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གསེར་བཟང་ཞིང་དྲི་མ་མེད་པའི་དབྱིག་གིས་སྤྲས་པའི་གཟི་བརྗིད་མཛེས་པའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཚན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པས་རྣམ་པར་དག་པའི་དཔལ་གྱི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དཔལ་གྱི་བེ་འུ་རྡོ་རྗེ་འོད་འཕྲོ་བས་བརྒྱན་པའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འོད་འབར་ཞིང་འཕྲོ་བའི་དཔལ་གྱི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐར་མའི་རྒྱལ་པོ་འོད་རབ་ཏུ་སྣང་བའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་མཛོད་ཡེ་ཤེས་བསྒྲིབས་པ་མེད་པའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་བསྒྲིབས་པ་མེད་ཅིང་ང་རོ་སྙན་པའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུངས་ཀྱི་སྙིང་པོ་ཡོན་ཏན་གྱི་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་ཡང་དག་པར་འཛིན་པའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྒྱ་མཚོའི་རྒྱན་གྱི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རི་རབ་དཔལ་གྱི་སྙིང་པོ་དང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་ཐམས་ཅད་རྣམ་པར་དག་པའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་དཔལ་གྱི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་གྲོལ་བའི་ཟླ་བ་དང་། དེ་དག་ལ་སྩོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚད་མེད་པ་གཞལ་དུ་མེད་པ། གྲངས་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་པ།
en: These bodhisattvas were the bodhisattva mahāsattva Vajra­garbha, the bodhisattva mahāsattva Ratna­garbha, the bodhisattva mahāsattva Padma­garbha, the bodhisattva mahāsattva Śrī­garbha, the bodhisattva mahāsattva Padma­śrī­garbha, the bodhisattva mahāsattva Sūrya­garbha, the bodhisattva mahāsattva Śuci­garbha, the bodhisattva mahāsattva Kṣiti­garbha, the bodhisattva mahāsattva Śaśi­vimala­garbha, the bodhisattva mahāsattva Sarva­vyūhālaṃkāra­pratibhāsa­saṃdarśana­garbha, the bodhisattva mahāsattva Jñāna­vairocana­garbha, the bodhisattva mahāsattva Rucira­śrī­garbha, the bodhisattva mahāsattva Candana­śrī­garbha, the bodhisattva mahāsattva Puṣpa­śrī­garbha, the bodhisattva mahāsattva Kusuma­śrī­garbha, the bodhisattva mahāsattva Utpala­śrī­garbha, the bodhisattva mahāsattva Deva­śrī­garbha, the bodhisattva mahāsattva Puṇya­śrī­garbha, the bodhisattva mahāsattva Anāvaraṇa­jñāna­viśuddhi­garbha, the bodhisattva mahāsattva Guṇa­śrī­garbha, the bodhisattva mahāsattva Nārāyaṇa­śrī­garbha, the bodhisattva mahāsattva Amala­garbha, the bodhisattva mahāsattva Vimala­garbha, the bodhisattva mahāsattva Vicitra­pratibhāṇālaṃkāra­garbha, the bodhisattva mahāsattva Mahā­raśmi­jālāvabhāsa­garbha, the bodhisattva mahāsattva Vimala­prabhāsa­śrī­tejorāja­garbha, the bodhisattva mahāsattva Suvarṇa­bhadra­vimala­vasucitra­tejolalita­garbha, the bodhisattva mahāsattva Sarva­lakṣaṇa­pratimaṇḍita­viśuddhi­śrī­garbha, the bodhisattva mahāsattva Vajrārciḥśrī­vatsālaṃkāra­garbha, the bodhisattva mahāsattva Jyotirjvalanārciḥ­śrī­garbha, the bodhisattva mahāsattva Nakṣatra­rāja­prabhāvabhāsa­garbha, the bodhisattva mahāsattva Gagana­kośā­nāvaraṇa­jñāna­garbha, the bodhisattva mahāsattva Anāvaraṇa­svara­maṇḍala­madhura­nirghoṣa­garbha, the bodhisattva mahāsattva Dhāraṇī­mukha­sarva­jagat­praṇidhi­saṃdhāraṇa­garbha, the bodhisattva mahāsattva Sāgara­vyūha­garbha, the bodhisattva mahāsattva Meru­śrī­garbha, the bodhisattva mahāsattva Sarva­guṇa­viśuddhi­garbha, the bodhisattva mahāsattva Tathāgata­śrī­garbha, the bodhisattva mahāsattva Buddha­śrī­garbha, the bodhisattva mahāsattva Vimukti­candra , and so on.

source: མཚུངས་པ་མྱེད་པ་དཔག་ཏུ་མེད་པ། ཀུན་ཏུ་མཐའ་ཡས་པ། མུ་མེད་པས་མཚམས་མྱེད་པ། བརྗོད་དུ་མྱེད་པའི་ཡང་བརྗོད་དུ་མེད་པ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེའི་སྙིང་པོ་ལ་སྩོགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་སྣ་ཚོགས་ནས་འདུས་པ་ཤ་སྟག་དང་། ཐབས་གཅིག་ཏུ་བཞུགས་སོ།
en: These boundless, innumerable, countless, inconceivable, unequaled, measureless, infinite, endless, unlimited, and most indescribable of indescribable bodhisattva mahāsattvas such as Vajra­garbha had all gathered there from various buddha realms.

source: །དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེའི་སྙིང་པོ་སངས་རྒྱས་ཀྱི་མཐུས་ཐེག་པ་ཆེན་པོ་རབ་ཏུ་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ།
en: Then at that time the bodhisattva mahāsattva Vajra­garbha, through the power of the Buddha, entered the samādhi called the radiance of the Mahāyāna

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེའི་སྙིང་པོས་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཐེག་པ་ཆེན་པོ་རབ་ཏུ་སྣང་བ་དེ་ལ་མཉམ་པར་བཞག་མ་ཐག་ཏུ། དེ་ནས་དེའི་ཚེ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཕྱོགས་རེ་རེའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཕ་རོལ་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀུན་ཀྱང་མཚན་རྡོ་རྗེའི་སྙིང་པོ་ཞེས་བྱ་བར་མཐུན་པ་ཤ་སྟག་གིས་ཞལ་མངོན་པར་བསྟན་ཏེ།
en: As soon as the bodhisattva mahāsattva Vajra­garbha entered the samādhi called the radiance of the Mahāyāna , buddha bhagavats who all had the name Vajra­garbha and were as numerous as the atoms in a hundred million buddha realms, who were from beyond worlds in the ten directions as numerous as the atoms in a hundred million buddha realms, appeared to him.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Those buddha bhagavats said these words:

source: །རྒྱལ་བའི་བུ་དེ་ལྟར་ཁྱོད་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཐེག་པ་ཆེན་པོ་རབ་ཏུ་སྣང་བ་ལ་སྙོམས་པར་ཞུགས་པ་ལེགས་སོ་ལེགས་སོ།
en: “O noble son! It is excellent, excellent that you have entered the samādhi called the radiance of the Mahāyāna

source: །འདི་ལྟར་རིགས་ཀྱི་བུ་ཁྱོད་ལ་ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀུན་ཀྱང་མཚན་རྡོ་རྗེའི་སྙིང་པོ་ཞེས་བྱ་བར་མཐུན་པ་ཤ་སྟག་གིས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་སྣང་མཛད་འདིའི་སྔོན་གྱི་སྨོན་ལམ་གྱི་བྱིན་གྱི་རླབས་དང་། ཁྱོད་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱི་ཁྱད་པར་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་སངས་རྒྱས་ཀྱི་ཆོས་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་རབ་ཏུ་བརྗོད་ཅིང་ཡེ་ཤེས་ཀྱིས་ལ་འཇུག་པར་བྱ་བ་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡང་དག་པར་བསྡུ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་རབ་ཏུ་དབྱེ་བ་ལ་མཁས་པར་བྱ་བ་དང་། ཆོས་ཐམས་ཅད་ལ་ཡེ་ཤེས་ཤིན་ཏུ་ཡངས་པར་བྱ་བ་དང་། ཤིན་ཏུ་ལེགས་པར་གནས་པའི་ཆོས་རབ་ཏུ་བསྟན་པ་དང་། ཡེ་ཤེས་ཐ་མྱི་དད་པ་རྣམ་པར་སྦྱང་བ་དང་འཇིག་རྟེན་གྱི་ཆོས་ཐམས་ཅད་ཀྱིས་གོས་པ་མྱེད་པར་བྱ་བ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡུལ་ཁོང་དུ་ཆུད་པར་བྱ་བ་ནས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་གྱི་བར་དུ་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་བརྩམ་པ་རབ་ཏུ་འཐོབ་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་མ་ནོར་བར་མངོན་པར་རྣམ་པར་དགོད་པ་ཤིན་ཏུ་བསྟན་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་ཡང་དག་པར་དམྱིགས་པར་བྱ་བ་དང་། ཟག་པ་མེད་པའི་ཆོས་ཀྱི་བྱེ་བྲག་རྣམ་པར་བསྒོམ་པ་དང་། རྣམ་པར་དབྱེ་བ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བའི་ཤེས་རབ་ཀྱི་སྣང་བ་ཆེན་པོ་ལ་མཁས་པའི་ཡེ་ཤེས་ཀྱི་རྒྱན་ཐོབ་པར་བྱ་བ་དང་། ཤིན་ཏུ་བརྟགས་པའི་ཡེ་ཤེས་ཀྱི་སྒོ་ལ་འཇུག་པར་བྱ་བ་དང་། གནས་ཀྱི་རྣམ་པ་ཅི་རིགས་སུ་བརྗོད་པ་དང་། སྤོབས་པའི་སྣང་བ་དམའ་བ་མྱེད་པ་ཐོབ་པར་བྱ་བ་དང་། ཐ་དད་པ་ཡང་དག་པར་ཤེས་པ་ཆེན་པོའི་ས་ཤིན་ཏུ་རྟོགས་པར་བྱ་བ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ལ་དྲན་པ་ཉམས་པ་མེད་པར་བྱ་བ་དང་། སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། ཐམས་ཅད་དུ་སོང་བའི་བློ་རྣམ་པར་གདོན་མི་ཟ་བ་ལ་མཁས་པ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་བྱིན་གྱིས་བརླབ་པ་མཛད་དོ།
en: In this way, noble son, the buddhas, the bhagavats in the ten directions, who are as numerous as the atoms in a hundred million buddha realms, and who all have the same name as you, which is Vajra­garbha, because of the blessing of the previous prayers of this bhagavat tathāgata arhat samyak­sambuddha Vairocana and because of your particular wisdom, give you their blessing so that through your teaching all bodhisattvas will (1) enter the bhūmis of the wisdom of the radiance of the Buddha’s inconceivable Dharma, (2) completely accumulate all roots of goodness, (3) become skilled in examining the entire Dharma of the Buddha, (4) possess a vast wisdom of the entire Dharma, (5) teach the perfectly preserved Dharma, (6) have the purified wisdom of indivisibility, (7) be unstained by all worldly qualities, (8) purify the transcendent roots of goodness, (9) realize the scope of inconceivable wisdom, and (10) ultimately attain the scope of omniscient wisdom. “This is for the purpose of commencing upon and attaining the ten bhūmis of the bodhisattvas through (1) the teaching that presents the bodhisattva bhūmis, (2) a focus on the entire Dharma of the Buddha, (3) meditation on the different kinds of immaculate qualities, (4) skill in the great light of wisdom that has analyzed the perfectly analyzed, (5) entry through the door of knowledge through perfect examination, (6) the bright illumination of the eloquence of explaining every kind of opposing standpoint, (7) the realization of the level of great discerning knowledge, (8) the continuous remembering of bodhicitta, (9) the ripening of all realms of beings, and (10) the acquisition of skillfulness through certainty in the comprehension of everything.

source: །དེ་བས་ན་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་སྒོ་རབ་ཏུ་དབྱེ་བ་ལ་མཁས་པར་འགྱུར་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་སངས་རྒྱས་ཀྱི་མཐུ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་སྣང་བའི་བྱིན་གྱི་རླབས་ཀྱིས་རང་གི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཤིན་ཏུ་སྦྱངས་པ་དང་། སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ལ་ཕན་གདགས་པ་དང་། ཆོས་ཀྱི་སྐུའི་ཡེ་ཤེས་ཀྱི་ལུས་ལ་འཇུག་པར་བྱ་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་དབང་བསྐུར་བ་ཡང་དག་པར་བླང་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་ཤིན་ཏུ་འཕགས་པའི་ལུས་འབྱུང་བར་བྱ་བ་དང་། འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་ལས་ཡང་དག་པར་འདའ་བར་བྱ་བ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཀྱི་ཚུལ་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་སྤོབས་པ་སྐྱེད་ཅིག །དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོ་ལ་ཟིལ་གྱིས་མི་ནོན་པར་ལུས་ཉེ་བར་བསྒྲུབ་པ་མཛད་དོ། །ཐོགས་པ་མྱེད་པའི་སྤོབས་པས་ཤིན་ཏུ་སྟོན་པ་ཉེ་བར་བསྒྲུབ་པ་མཛད་དོ། །ཤིན་ཏུ་སྦྱངས་པའི་ཡེ་ཤེས་རྣམ་པར་ཕྱེ་བ་ལ་འཇུག་པ་ཉེ་བར་བསྒྲུབ་པ་མཛད་དོ། །དྲན་པ་ཉམས་པ་མྱེད་པའི་བྱིན་གྱི་རླབས་ཉེ་བར་བསྒྲུབ་པ་མཛད་དོ། །བློ་གྲོས་ཤིན་ཏུ་ངེས་པར་རྟོགས་པས་མཁས་པ་ཉེ་བར་བསྒྲུབ་པ་མཛད་དོ། །ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བའི་བློའི་རྗེས་སུ་འགྲོ་བ་ཉེ་བར་བསྒྲུབ་པ་མཛད་དོ།
en: “Therefore, noble son, be eloquent in this Dharma teaching, which is being skillful in the different doors of the Dharma, so that through the power of the buddhas and the blessing of the light of the wisdom of the tathāgatas there will be (1) the complete purification of your roots of goodness, (2) the complete purification of the essence of phenomena, (3) benefit for all the realms of beings, (4) the dharmakāya, which is the body of wisdom, (5) the consecration received from all the buddhas, (6) the appearance of a body in all worlds, (7) the transcendence of all worldly existences, (8) the complete purification of the way of world-transcending qualities, and (9) the perfection of omniscient wisdom.”

source: །ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་སྟོབས་ཐུབ་པ་མྱེད་པ་ཉེ་བར་བསྒྲུབ་པ་མཛད་དོ། །དེ་བཞིན་གཤེགས་པའི་མྱི་འཇིགས་པ་ཆེ་ཞིང་ཞུམ་པ་མྱེད་པ་ཉེ་བར་བསྒྲུབ་པ་མཛད་དོ། །ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་དང་ཐ་དད་པ་ཡང་དག་པར་མཁྱེན་པས་རྣམ་པར་དབྱེ་བའི་ཆོས་ཀྱི་ཚུལ་ཤིན་ཏུ་རྟོག་པར་བྱ་བ་ཉེ་བར་བསྒྲུབ་པ་མཛད་དོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་དང་། གསུང་དང་ཐུགས་ཀྱི་རྒྱན་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་མངོན་པར་བསྡུ་བ་ཉེ་བར་བསྒྲུབ་པ་མཛད་དོ།
en: Then those buddha bhagavats provided the bodhisattva Vajra­garbha with (1) an unsurpassable body, (2) unimpeded eloquence in teaching, (3) the process of analysis through completely purified wisdom, (4) the blessing of unfailing memory, (5) skill in definitive understanding, (6) the judgment that is never lost in any situation, (7) the invincible strengths of a complete buddha, (8) the strengths and confidences of the tathāgatas, who will never be discouraged, (9) the accomplishment of the different aspects of the Dharma through the discerning knowledge of omniscient wisdom, and (10) the adornment of the unique aspects of the body, speech, and mind of the tathāgatas.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why did this happen?

source: དེ་ནི་ཏིང་ངེ་འཛིན་དེ་ཉིད་ཀྱི་ཆོས་ཉིད་རབ་ཏུ་ཐོབ་པ་དང་། སྔོན་གྱི་སྨོན་ལམ་གྱིས་མངོན་པར་བསྒྲུབས་པ་དང་ལྷག་པའི་བསམ་པ་ཤིན་ཏུ་རྣམ་པར་སྦྱངས་པ་དང་། ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་ཤིན་ཏུ་སྦྱངས་པ་དང་། ཚོགས་ཤིན་ཏུ་བསྩགས་པ་དང་། ཡོངས་སུ་སྦྱང་བ་ཤིན་ཏུ་བྱས་པ་དང་། དྲན་པའི་སྣོད་ཚད་མེད་པ་དང་། མོས་པ་རྣམ་པར་དག་ཅིང་འོད་ཤིན་ཏུ་གསལ་བ་དང་། གཟུངས་ཀྱི་སྒོ་ཐ་མི་དད་པ་ཐོབ་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཡེ་ཤེས་ཀྱི་ཕྱག་རྒྱས་ཤིན་ཏུ་བཏབ་པའི་ཕྱིར་རོ།
en: It was because he (1) had attained the intrinsic nature of that samādhi, (2) had accomplished a previous prayer, (3) had perfectly purified higher motivation, (4) had the perfectly clarified circle of wisdom, (5) had perfectly accumulated the accumulations, (6) had become perfectly immaculate, (7) had become a vessel for limitless memory, (8) had the purity of clear motivation, and (9) had perfectly realized the distinct doors of retention, and because he had (10) applied the seal of the knowledge of the essence of the Dharma.

source: །དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་དེ་དག་ན་བཞུགས་བཞིན་དུ་རྫུ་འཕྲུལ་གྱི་མཐུས་སོ་སོ་ནས་ཕྱག་གཡས་པ་བརྐྱང་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོའི་མགོ་ལ་བྱུག་པ་མཛད་དོ།
en: Those buddha bhagavats who were present there extended their right hands through their miraculous power and stroked the bodhisattva Vajra­garbha’s head.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོ་ལ་རེག་མ་ཐག་ཏུ་དེ་ཉིད་ཀྱི་ཚེ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་སྨྲས་པ།
en: As soon as the bodhisattva Vajra­garbha was touched by those buddha bhagavats, he arose from that samādhi and said to the bodhisattvas, “O jinaputras!

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་འདི་ནི་ཤིན་ཏུ་རྣམ་པར་གདོན་མི་ཟ་བ་སྟེ། ཐ་མི་དད་པ་བལྟར་མེད་པ་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པར་ཡངས་པ། ནམ་མཁའི་དབྱིངས་ཀྱི་མཐར་ཐུག་པ། ཕྱི་མའི་མཐའི་མུར་ཐུག་པ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་དུ་རྒྱས་པར་ཁྱབ་པ། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱིས་བརླབས་པ་སྟེ།
en: This bodhisattva aspiration (1) is perfectly certain, (2) is not separate, (3) cannot be viewed, (4) is the vast essence of the Dharma, (5) extends to the limits of space, (6) reaches the ultimate conclusion, and (7) is the protection of the realm of beings.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཡེ་ཤེས་ཀྱི་ས་ལ་ཡང་རབ་ཏུ་འཇུག་པར་འགྱུར་རོ།
en: “O jinaputras! The bodhisattva mahāsattvas enter the wisdom bhūmis of the buddha bhagavats of the past.

source: །མ་བྱོན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཡེ་ཤེས་ཀྱི་ས་ལ་ཡང་རབ་ཏུ་འཇུག་པར་འགྱུར་རོ།
en: They enter the wisdom bhūmis of the buddha bhagavats of the future.

source: །ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཡེ་ཤེས་ཀྱི་ས་ལ་ཡང་རབ་ཏུ་འཇུག་པར་འགྱུར་རོ།
en: They enter the wisdom bhūmis of the buddha bhagavats of the present.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལ་བཅུ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡེ་ཤེས་ཀྱིས་རྣམས་ཏེ།
en: “O jinaputras! There are ten bodhisattva bhūmis that are entering the wisdom bhūmis of the buddha bhagavats. “O jinaputras!

source: གང་ལ་བསམས་ཏེ་བདག་གིས་དེ་སྐད་དུ་སྨྲས་པ་དེ་དག་ནི། འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་གསུངས་སོ། །གསུང་ངོ་། །གསུང་བར་འགྱུར་རོ།
en: What I say to you is what the buddha bhagavats of the past, future, and present have taught, will teach, and are teaching.

source: །བཅུ་གང་ཞེ་ན།
en: “What are these ten?

source: འདི་ལྟ་སྟེ།
en: They are the following:

source: རབ་ཏུ་དགའ་བ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་དང་། དྲི་མ་དང་བྲལ་བ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་ས་གཉིས་པ་དང་། འོད་བྱེད་པ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་ས་གསུམ་པ་དང་། འོད་འཕྲོ་བ་ཅན་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་ས་བཞི་པ་དང་། རྒྱལ་བར་དཀའ་བ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་ས་ལྔ་པ་དང་། མངོན་སུམ་པ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་པས་ས་དྲུག་པ་དང་། རིང་དུ་སོང་བ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པ་དང་། མི་གཡོ་བ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་ས་བརྒྱད་པ་དང་། ལེགས་པའི་བློ་གྲོས་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་ས་དགུ་པ་དང་། ཆོས་ཀྱི་སྤྲིན་ཅེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པ་སྟེ།
en: (1) Perfect Joy is the first bhūmi of the bodhisattva, (2) Stainless is the second bhūmi of the bodhisattva, (3) Shining is the third bhūmi of the bodhisattva, (4) Brilliance is the fourth bhūmi of the bodhisattva, (5) Difficult to Conquer is the fifth bhūmi of the bodhisattva, (6) Manifested is the sixth bhūmi of the bodhisattva, (7) Gone Far is the seventh bhūmi of the bodhisattva, (8) Unwavering is the eighth bhūmi of the bodhisattva, (9) Perfect Understanding is the ninth bhūmi of the bodhisattva, and (10) Cloud of Dharma is the tenth bhūmi of the bodhisattva. “O jinaputras!

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་རྣམས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པ་སྟེ། དེ་ནི་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་གསུངས་སོ། །གསུང་ངོ་། །གསུང་བར་འགྱུར་རོ།
en: These are the ten bodhisattva bhūmis of the bodhisattvas that the buddha bhagavats of the past, future, and present have taught, will teach, and are teaching.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །བདག་གིས་ནི་སངས་རྒྱས་ཀྱི་ཞིང་གང་ན་འང་དེ་བཞིན་གཤེགས་པ་དག་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས། བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པོ་འདི་དག་མི་གསུང་བ་དེ་ལྟ་བུ་མ་མཐོང་ངོ་།
en: “O jinaputras! I see that throughout all buddha realms there are no tathāgata arhat samyak­sambuddhas who do not teach these ten bodhisattva bhūmis.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་ལམ་ཡོངས་སུ་སྦྱོང་བའི་ཆོས་སྣང་བའི་སྒོ་འདི་ནི་ཡང་དག་ཕུལ་ཞེས་བྱ་བ་ཡིན་ཏེ།
en: O jinaputras! The light from this doorway to the Dharma of purifying the bodhisattva path of the bodhisattva mahāsattvas is called most excellent

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ས་རྣམ་པར་དགོད་པ་ཤིན་ཏུ་བསྟན་པའོ།
en: It is an inconceivable presentation of the classification of the ten bhūmis of the bodhisattvas.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་གནས་འདི་ནི་བསམ་གྱིས་མི་ཁྱབ་པ་སྟེ།
en: O jinaputras!

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཤེས་པའོ།
en: That is this level of the knowledge of the bhūmis.”
